{
  "kind": "build_request",
  "title": "Documentation hub for “OTP Auto Copy” (Android) security/compliance + sample Kotlin code",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a frontend documentation experience that presents the complete “OTP Auto Copy” Android app design and deliverables as readable pages/sections: architecture explanation (MVVM + Clean Architecture), required permissions list, OTP detection approach (SMS User Consent API / SMS Retriever API) with policy rationale, OTP regex/extraction logic (4–8 digits) and non-OTP ignoring heuristics, sample Kotlin code snippets (Consent/Retriever handling, parsing, clipboard, auto-clear timer), UI screen specs (Settings, Permissions, About), Google Play compliance checklist for SMS/OTP handling, and a privacy policy outline that explicitly states offline-only behavior and no storage/transmission.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Deliverables:\n1. App architecture explanation\n2. Required permissions list\n3. OTP detection and regex logic\n4. Sample Kotlin code\n5. Clipboard implementation\n6. UI screens (Settings, Permissions, About)\n7. Play Store compliance checklist\n8. Privacy Policy outline"
        ]
      },
      "acceptanceCriteria": [
        "All eight deliverables are present and easy to navigate (e.g., top-level nav or sidebar with anchors).",
        "All user-facing text is in English.",
        "Kotlin code snippets are formatted for readability (monospace blocks) and include the requested areas: detection, regex, clipboard, auto-clear, and screen outlines.",
        "The compliance checklist includes clear items tied to avoiding READ_SMS, using User Consent/Retriever APIs, data minimization, and disclosure expectations."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add an explicit “Platform & Limitations” section that clearly states what is and is not implementable in a web app generated by this project (React + Motoko on the Internet Computer), specifically that automatic SMS detection and the Android-specific SMS User Consent/Retriever APIs require a native Android app and cannot be executed from a browser-based app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Platform: Android",
          "Security & Compliance Requirements:\n- Use SMS User Consent API or SMS Retriever API\n- Avoid unrestricted READ_SMS permission"
        ]
      },
      "acceptanceCriteria": [
        "The documentation includes a clearly labeled section that distinguishes native Android capabilities from web app capabilities.",
        "The limitation statement is unambiguous about SMS access and Android-only APIs."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement a small, offline-only OTP extraction playground in the frontend: a text input for a pasted SMS message, an “Extract OTP” action, and a “Copy OTP” action that copies the extracted 4–8 digit code to the clipboard, showing user feedback (“OTP copied”). Include a user-configurable auto-clear clipboard timer setting (e.g., 15s/30s/60s/never) that clears the clipboard after the selected delay.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Extract OTP codes (4–8 digits)",
          "Automatically copy OTP to clipboard",
          "Show a toast or notification saying “OTP copied”",
          "Auto-clear clipboard after a configurable time",
          "Work completely offline"
        ]
      },
      "acceptanceCriteria": [
        "Given an input containing a 4–8 digit OTP, the UI extracts and displays the OTP.",
        "Non-OTP input does not produce a code and clearly indicates no OTP was detected.",
        "Copy action places the OTP on the clipboard and shows feedback text exactly: “OTP copied”.",
        "If auto-clear is enabled, the clipboard is cleared after the configured duration (best-effort in-browser) without requiring network access.",
        "No network calls are made by this feature."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Enforce offline-only behavior in the frontend by ensuring there are no analytics, no logging of OTP content, and no network calls related to OTP extraction/copying; do not persist OTPs to local storage. Any settings stored should exclude OTP data and only include non-sensitive preferences (e.g., clipboard clear delay).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "No logging, no analytics, no network calls",
          "Do not store or transmit OTP data",
          "Work completely offline"
        ]
      },
      "acceptanceCriteria": [
        "No OTP values are written to any persistent storage.",
        "No OTP values are sent over the network.",
        "No console logging includes OTP content.",
        "Settings persistence (if implemented) contains only non-sensitive preferences."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Choose and apply a coherent, professional visual theme for the documentation and playground UI (colors, typography, spacing, components) with a distinct style appropriate for a security/privacy-focused utility. Do not use a blue/purple primary palette.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ]
      },
      "acceptanceCriteria": [
        "Theme is applied consistently across navigation, headings, code blocks, and forms.",
        "Primary palette is not blue/purple.",
        "Layout is readable and looks production-quality (clear hierarchy, spacing, accessible contrast)."
      ]
    }
  ],
  "constraints": [
    "Project stack is limited to React (TypeScript) frontend and Motoko backend on the Internet Computer; native Android/Kotlin compilation and Android OS APIs (SMS User Consent API / SMS Retriever API) cannot be executed from this codebase.",
    "Do not edit files under frontend/src/components/ui or any immutable paths listed in SYSTEM_CONTEXT.",
    "Use English for all user-facing text in the build request and resulting UI content."
  ],
  "nonGoals": [
    "Building or shipping a native Android APK/AAB.",
    "Requesting or implementing unrestricted SMS permissions (e.g., READ_SMS) in this codebase.",
    "Implementing real SMS interception/auto-detection in the browser.",
    "Adding analytics, remote logging, or any network-based OTP processing."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}